app/helpers/application_helper.rb

  def latest_fuel_price
    FuelPrice.order(updated_at: :desc).first
---
SELECT "fuel_prices".* FROM "fuel_prices" ORDER BY "fuel_prices"."updated_at" DESC LIMIT ?  [["LIMIT", 1]]