app/controllers/fuel_prices_controller.rb

  def index
    @fuel_prices = FuelPrice.all
---
SELECT "fuel_prices".* FROM "fuel_prices"

  def create
    @fuel_price = FuelPrice.new(fuel_price_params)

    respond_to do |format|
      if @fuel_price.save
---
INSERT INTO "fuel_prices" ("jet_a_self_service", "jet_a_full_service", "ll_self_service", "ll_full_service", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_fuel_price
      @fuel_price = FuelPrice.find(params[:id])
---
SELECT "fuel_prices".* FROM "fuel_prices" WHERE "fuel_prices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]